<?php
/**
 * Created by PhpStorm.
 * User: Hungokata
 * Date: 2/6/19
 * Time: 15:37
 */

class RequestCustome
{
    public function checkData($arrField = [], $data = [])
    {
        $arrReturn = array();
        foreach ($arrField as $key => $value) {
            if (count($value) < 1)
                continue;

            $value = array_values($value);
            $temp = isset($data[$key]) ? $data[$key] : @$value[1];
            switch ($value[0]) {
                case    'str'    :
                    $temp = convert_utf82utf8(strval($temp));
                    break;
                case    'int' :
                    $temp = (int)$temp;
                    break;
                case    'flo' :
                    $temp = floatval($temp);
                    break;
                case    'dbl' :
                    $temp = doubleval($temp);
                    break;
                case    'arr'    :
                    $temp = is_array($temp) ? $temp : array();
                    break;
                case    'arrint'    :
                    if (is_numeric($temp) && $temp > 0)
                        $temp = array(intval($temp));
                    else {
                        $temp = is_array($temp) ? $temp : array();
                        $temp = array_map('intval', $temp);
                    }
                    break;
            }

            $arrReturn[$key] = $temp;
        }
        return $arrReturn;
    }
}

if (!function_exists('convert_utf82utf8')) {
    function convert_utf82utf8($str = '', $removeAccent = 0)
    {
        $new_str = '';
        $marTViet = array(
            // Chữ thường
            "à", "á", "ạ", "ả", "ã", "â", "ầ", "ấ", "ậ", "ẩ", "ẫ", "ă", "ằ", "ắ", "ặ", "ẳ", "ẵ",
            "è", "é", "ẹ", "ẻ", "ẽ", "ê", "ề", "ế", "ệ", "ể", "ễ",
            "ì", "í", "ị", "ỉ", "ĩ",
            "ò", "ó", "ọ", "ỏ", "õ", "ô", "ồ", "ố", "ộ", "ổ", "ỗ", "ơ", "ờ", "ớ", "ợ", "ở", "ỡ",
            "ù", "ú", "ụ", "ủ", "ũ", "ư", "ừ", "ứ", "ự", "ử", "ữ",
            "ỳ", "ý", "ỵ", "ỷ", "ỹ",
            "đ", "Đ",
            "À", "Á", "Ạ", "Ả", "Ã", "Â", "Ầ", "Ấ", "Ậ", "Ẩ", "Ẫ", "Ă", "Ằ", "Ắ", "Ặ", "Ẳ", "Ẵ",
            "È", "É", "Ẹ", "Ẻ", "Ẽ", "Ê", "Ề", "Ế", "Ệ", "Ể", "Ễ",
            "Ì", "Í", "Ị", "Ỉ", "Ĩ",
            "Ò", "Ó", "Ọ", "Ỏ", "Õ", "Ô", "Ồ", "Ố", "Ộ", "Ổ", "Ỗ", "Ơ", "Ờ", "Ớ", "Ợ", "Ở", "Ỡ",
            "Ù", "Ú", "Ụ", "Ủ", "Ũ", "Ư", "Ừ", "Ứ", "Ự", "Ử", "Ữ",
            "Ỳ", "Ý", "Ỵ", "Ỷ", "Ỹ",
            "Đ", "Đ"
        );
        $arrTohop = array(0 => 'à', 1 => 'á', 2 => 'ạ', 3 => 'ả', 4 => 'ã', 5 => 'â', 6 => 'ầ', 7 => 'ấ', 8 => 'ậ', 9 => 'ẩ', 10 => 'ẫ', 11 => 'ă', 12 => 'ằ', 13 => 'ắ', 14 => 'ặ', 15 => 'ẳ', 16 => 'ẵ', 17 => 'è', 18 => 'é', 19 => 'ẹ', 20 => 'ẻ', 21 => 'ẽ', 22 => 'ê', 23 => 'ề', 24 => 'ế', 25 => 'ệ', 26 => 'ể', 27 => 'ễ', 28 => 'ì', 29 => 'í', 30 => 'ị', 31 => 'ỉ', 32 => 'ĩ', 33 => 'ò', 34 => 'ó', 35 => 'ọ', 36 => 'ỏ', 37 => 'õ', 38 => 'ô', 39 => 'ồ', 40 => 'ố', 41 => 'ộ', 42 => 'ổ', 43 => 'ỗ', 44 => 'ơ', 45 => 'ờ', 46 => 'ớ', 47 => 'ợ', 48 => 'ở', 49 => 'ỡ', 50 => 'ù', 51 => 'ú', 52 => 'ụ', 53 => 'ủ', 54 => 'ũ', 55 => 'ư', 56 => 'ừ', 57 => 'ứ', 58 => 'ự', 59 => 'ử', 60 => 'ữ', 61 => 'ỳ', 62 => 'ý', 63 => 'ỵ', 64 => 'ỷ', 65 => 'ỹ', 66 => 'đ', 67 => 'Đ', 68 => 'À', 69 => 'Á', 70 => 'Ạ', 71 => 'Ả', 72 => 'Ã', 73 => 'Â', 74 => 'Ầ', 75 => 'Ấ', 76 => 'Ậ', 77 => 'Ẩ', 78 => 'Ẫ', 79 => 'Ă', 80 => 'Ằ', 81 => 'Ắ', 82 => 'Ặ', 83 => 'Ẳ', 84 => 'Ẵ', 85 => 'È', 86 => 'É', 87 => 'Ẹ', 88 => 'Ẻ', 89 => 'Ẽ', 90 => 'Ê', 91 => 'Ề', 92 => 'Ế', 93 => 'Ệ', 94 => 'Ể', 95 => 'Ễ', 96 => 'Ì', 97 => 'Í', 98 => 'Ị', 99 => 'Ỉ', 100 => 'Ĩ', 101 => 'Ò', 102 => 'Ó', 103 => 'Ọ', 104 => 'Ỏ', 105 => 'Õ', 106 => 'Ô', 107 => 'Ồ', 108 => 'Ố', 109 => 'Ộ', 110 => 'Ổ', 111 => 'Ỗ', 112 => 'Ơ', 113 => 'Ờ', 114 => 'Ớ', 115 => 'Ợ', 116 => 'Ở', 117 => 'Ỡ', 118 => 'Ù', 119 => 'Ú', 120 => 'Ụ', 121 => 'Ủ', 122 => 'Ũ', 123 => 'Ư', 124 => 'Ừ', 125 => 'Ứ', 126 => 'Ự', 127 => 'Ử', 128 => 'Ữ', 129 => 'Ỳ', 130 => 'Ý', 131 => 'Ỵ', 132 => 'Ỷ', 133 => 'Ỹ', 134 => 'Đ', 135 => 'Đ');
        if ($str != '') {
            $new_str = str_replace($arrTohop, $marTViet, $str);
        }

        if ($removeAccent == 1) {
            $new_str = strtolower(remove_accent($new_str));
        }

        return $new_str;

    }
}